#+TITLE: mu-wizard
#+AUTHOR: Cem Keylan
#+STARTUP: indent

=mu-wizard= is a shell script to auto-configure email accounts for =mu4e=
similar in function to =mutt-wizard=. It uses =isync= to synchronize mail
accounts, =msmtp= to send mail and creates individual Lisp profiles for each
account. It is still WIP. Expect breaking changes until the first release.

* Usage

The wizard is called by running ~muw~. The commands below are available to use:

#+BEGIN_SRC sh :results raw :exports results
./bin/muw --help | sed -E '/^Commands:/,/^$/!d;/Commands:/d;/^$/d;s|^ *([a-zA-Z-]*) *(.*)$|- =\1= :: \2|'
#+END_SRC

#+RESULTS:
- =add= :: Add and autoconfigure an email address
- =delete= :: Pick an account to delete
- =list= :: List configured accounts
- =purge= :: Purge all configuration
- =sync= :: Sync mail for accounts
- =mu-init= :: Run 'mu init' with the configured accounts
- =data= :: Output system data directory and exit

You can run ~muw COMMAND --help~ for learning more about the usage of the
command. The entire documentation can be found on manual pages.

